; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	spectrograph2 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	GroundStation3 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation11 - direction
	Star12 - direction
	GroundStation13 - direction
	GroundStation1 - direction
	GroundStation7 - direction
	Star0 - direction
	Star2 - direction
	GroundStation14 - direction
	GroundStation10 - direction
	Star5 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Star18 - direction
	Phenomenon19 - direction
	Planet20 - direction
	Planet21 - direction
	Planet22 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation14)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star18)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star5)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon16)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite1 Phenomenon16)
	(have_image Planet15 spectrograph1)
	(have_image Phenomenon16 spectrograph2)
	(have_image Planet17 spectrograph0)
	(have_image Star18 spectrograph2)
	(have_image Phenomenon19 spectrograph0)
	(have_image Planet20 spectrograph2)
	(have_image Planet21 spectrograph0)
	(have_image Planet22 spectrograph2)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 10
2. (turn_to satellite0 groundstation4 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 groundstation4)
   goals met: 2 of 10
3. (turn_to satellite1 star5 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 star5)
   goals met: 1 of 10
4. (calibrate satellite1 instrument2 star5)
   added: (calibrated instrument2)
   goals met: 1 of 10
5. (turn_to satellite1 phenomenon16 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon16)
   goals met: 2 of 10
6. (take_image satellite1 phenomenon16 instrument2 spectrograph2)
   added: (have_image phenomenon16 spectrograph2)
   goals met: 3 of 10
7. (turn_to satellite1 phenomenon19 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon19)
   goals met: 2 of 10
8. (take_image satellite1 phenomenon19 instrument2 spectrograph0)
   added: (have_image phenomenon19 spectrograph0)
   goals met: 3 of 10
9. (turn_to satellite1 phenomenon16 phenomenon19)
   deleted: (pointing satellite1 phenomenon19)
   added: (pointing satellite1 phenomenon16)
   goals met: 4 of 10
10. (turn_to satellite1 planet15 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet15)
   goals met: 3 of 10
11. (take_image satellite1 planet15 instrument2 spectrograph1)
   added: (have_image planet15 spectrograph1)
   goals met: 4 of 10
12. (turn_to satellite1 phenomenon16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 phenomenon16)
   goals met: 5 of 10
13. (turn_to satellite1 planet17 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet17)
   goals met: 4 of 10
14. (take_image satellite1 planet17 instrument2 spectrograph0)
   added: (have_image planet17 spectrograph0)
   goals met: 5 of 10
15. (turn_to satellite1 phenomenon16 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 phenomenon16)
   goals met: 6 of 10
16. (turn_to satellite1 planet20 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet20)
   goals met: 5 of 10
17. (take_image satellite1 planet20 instrument2 spectrograph2)
   added: (have_image planet20 spectrograph2)
   goals met: 6 of 10
18. (turn_to satellite1 phenomenon16 planet20)
   deleted: (pointing satellite1 planet20)
   added: (pointing satellite1 phenomenon16)
   goals met: 7 of 10
19. (turn_to satellite1 planet21 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet21)
   goals met: 6 of 10
20. (take_image satellite1 planet21 instrument2 spectrograph0)
   added: (have_image planet21 spectrograph0)
   goals met: 7 of 10
21. (turn_to satellite1 phenomenon16 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 phenomenon16)
   goals met: 8 of 10
22. (turn_to satellite1 planet22 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet22)
   goals met: 7 of 10
23. (take_image satellite1 planet22 instrument2 spectrograph2)
   added: (have_image planet22 spectrograph2)
   goals met: 8 of 10
24. (turn_to satellite1 phenomenon16 planet22)
   deleted: (pointing satellite1 planet22)
   added: (pointing satellite1 phenomenon16)
   goals met: 9 of 10
25. (turn_to satellite1 star18 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 star18)
   goals met: 8 of 10
26. (take_image satellite1 star18 instrument2 spectrograph2)
   added: (have_image star18 spectrograph2)
   goals met: 9 of 10
27. (turn_to satellite1 phenomenon16 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 phenomenon16)
   goals met: 10 of 10
